[
    {
        "title": "Mi Blog de Tecnología",
        "content": [
            {
                "name": "Entendiendo JavaScript Asíncrono",
                "description": "Una inmersión profunda en el mundo de la programación asíncrona en JavaScript, cubriendo callbacks, promesas y async/await.",
                "slug": "entendiendo-javascript-asincrono",
                "date": "2024-08-01"
            },
            {
                "name": "Empezando con React",
                "description": "Una guía introductoria para construir interfaces de usuario con React, una popular biblioteca de JavaScript para crear aplicaciones web.",
                "slug": "empezando-con-react",
                "date": "2024-07-15"
            },
            {
                "name": "CSS Grid Layout: Una Guía Completa",
                "description": "Aprende todo lo que necesitas saber sobre CSS Grid Layout, un potente sistema de diseño para crear diseños web responsivos.",
                "slug": "guia-completa-css-grid-layout",
                "date": "2024-06-20"
            },
            {
                "name": "Construyendo APIs RESTful con Node.js",
                "description": "Un tutorial completo sobre la creación de APIs RESTful usando Node.js y Express, cubriendo desde la configuración básica hasta características avanzadas.",
                "slug": "construyendo-apis-restful-con-nodejs",
                "date": "2024-05-05"
            },
            {
                "name": "Guía para Principiantes de TypeScript",
                "description": "Una introducción a TypeScript, un superconjunto de JavaScript tipado que añade tipado estático al lenguaje, ayudando a los desarrolladores a escribir código más robusto.",
                "slug": "guia-para-principiantes-de-typescript",
                "date": "2024-04-10"
            }
        ]
    },
    {
        "title": "Perspectivas del Desarrollador",
        "content": [
            {
                "name": "Dominando Git y GitHub",
                "description": "Una guía completa sobre el control de versiones usando Git y GitHub, incluyendo comandos básicos, ramificación, fusión y flujos de trabajo de colaboración.",
                "slug": "dominando-git-y-github",
                "date": "2024-08-15"
            },
            {
                "name": "Introducción a Python para Ciencia de Datos",
                "description": "Un artículo introductorio sobre el uso de Python para ciencia de datos, cubriendo bibliotecas como pandas, NumPy y Matplotlib.",
                "slug": "introduccion-a-python-para-ciencia-de-datos",
                "date": "2024-07-30"
            },
            {
                "name": "Top 10 Extensiones de VS Code para Desarrolladores Web",
                "description": "Una lista seleccionada de las 10 mejores extensiones de Visual Studio Code que pueden mejorar tu flujo de trabajo de desarrollo web.",
                "slug": "top-10-extensiones-vs-code-para-desarrolladores-web",
                "date": "2024-07-05"
            },
            {
                "name": "Desmitificando Docker: Una Guía para Principiantes",
                "description": "Aprende lo básico de Docker, una herramienta que permite a los desarrolladores empaquetar aplicaciones y sus dependencias en un contenedor portátil.",
                "slug": "desmitificando-docker-guia-para-principiantes",
                "date": "2024-06-18"
            },
            {
                "name": "Consejos de Rendimiento en JavaScript",
                "description": "Explora una serie de consejos y mejores prácticas para optimizar el código JavaScript para un mejor rendimiento en aplicaciones web.",
                "slug": "consejos-de-rendimiento-en-javascript",
                "date": "2024-06-01"
            }
        ]
    }
]